#Задача 2: Найдите сумму цифр трехзначного числа.

num = input("введите трехзначное число: ")
print(num)
a = int(num[0])
b = int(num[1])
c = int(num[2])
print(f'сумма цифр трехзначного числа равна -> {a+b+c}')
